#### OpenTofu Format and Style 🖌`failure`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/04f9bee3-e68d-4e2a-8edb-6d6cdbca4348/resourceGroups/rg-cncf-opentofu]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/04f9bee3-e68d-4e2a-8edb-6d6cdbca4348/resourceGroups/rg-cncf-opentofu/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/04f9bee3-e68d-4e2a-8edb-6d6cdbca4348/resourceGroups/rg-cncf-opentofu/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_network_interface.example: Refreshing state... [id=/subscriptions/04f9bee3-e68d-4e2a-8edb-6d6cdbca4348/resourceGroups/rg-cncf-opentofu/providers/Microsoft.Network/networkInterfaces/example-nic]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_linux_virtual_machine.example will be created
  + resource "azurerm_linux_virtual_machine" "example" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus2"
      + max_bid_price                                          = -1
      + name                                                   = "linuxmachine"
      + network_interface_ids                                  = [
          + "/subscriptions/04f9bee3-e68d-4e2a-8edb-6d6cdbca4348/resourceGroups/rg-cncf-opentofu/providers/Microsoft.Network/networkInterfaces/example-nic",
        ]
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-cncf-opentofu"
      + size                                                   = "Standard_F2"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @Schiiss, Action: `pull_request`, Workflow: `Terraform`*